app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "name") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2018-05-07 08:59:48.697038"], ["updated_at", "2018-05-07 08:59:48.697038"], ["name", "hoge"]]
---
  def create
    json_request = JSON.parse(request.body.read)
    @user = User.new(name: json_request['user']['name'].to_s)

    if @user.save